---
kind: type
id: T:Autodesk.Revit.DB.FaceNode
source: html/fbd0d7af-ac40-e81e-8e06-8b2ce90be28b.htm
---
# Autodesk.Revit.DB.FaceNode

An output node that represents a Face.

## Syntax (C#)
```csharp
public class FaceNode : RenderNode
```

## Remarks
See also: OnFaceBegin(FaceNode) .